# PANDAS SERIES

In [5]:
import numpy as np
import pandas as pd

In [6]:
labels = ['a', 'b', 'c']
num_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10,'b':20,'c':30}

In [13]:
pd.Series(data=num_list)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data=num_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
salesQ1 = pd.Series(data=[250,450,200,150], index=['USA', 'China', 'India', 'Brazil'])

In [17]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [18]:
salesQ2 = pd.Series(data=[260,500,210,100], index=['USA', 'China', 'India', 'Japan'])

In [20]:
salesQ2['China']

500

In [24]:
salesQ2[1]

500

In [25]:
salesQ1 + salesQ2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

# PANDAS DATAFRAMES

In [36]:
columns = ['W','X','Y','Z']

In [32]:
index = ['A','B','C','D','E']

In [35]:
np.random.seed(42)
data = np.random.randint(-100, 100, (5, 4))

In [30]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [37]:
df = pd.DataFrame(data, index, columns)

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [41]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [40]:
type(df['W'])

pandas.core.series.Series

In [42]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [44]:
df['new'] = df['W'] + df['Y']

In [45]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [47]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [48]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [49]:
df.drop('E', axis=0)

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19

In [50]:
df.loc['A']

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [51]:
df.loc[['A','E']]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
E  30  49 -48 -99  -18

In [52]:
df.iloc[0]

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [53]:
df.iloc[[0, -1]]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
E  30  49 -48 -99  -18

# GROUPBY OPERATIONS

# PANDAS OPERATIONS

# DATA INPUT AND OUTPUT

# PANDAS EXERCISES